Reports/20200729_215127/DataDrivenTestingDemoSuite/20200729_215127/requests/main/0.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2020-07-29T14:51:31.213Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <CapitalCity xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sCountryISOCode>ID</sCountryISOCode>\n        </CapitalCity>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 334,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CapitalCityResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CapitalCityResult>Jakarta</m:CapitalCityResult>\r\n    </m:CapitalCityResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 334,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "connect" : 4039,
        "ssl" : -1,
        "blocked" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0,
        "dns" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "0",
        "testObjectId" : "Object Repository/CountryInfoSOAPService/GetCapital",
        "harId" : "cedddd27-fc2a-4b1e-902f-abdd681f5811",
        "reportFolder" : null
      },
      "time" : 4039
    } ],
    "comment" : ""
  }
}